Clustering of Unemployment and Crime Data

In [75]:
import pandas as pd

In [91]:
# Import Data

# Create DataFrame from Unemployment Data
unemp_file_path = "Resources/unemployment_by_state_1980_2018_BLSdata.csv"
unemp_df = pd.read_csv(unemp_file_path)

# Create DataFrame from FBI UCR Crime data
crime_file_path = "Resources/est_crimes_1980_2018_FBI_UCRdata.csv"
fbi_crime_df = pd.read_csv(crime_file_path)

Unemployment EDA

In [92]:
unemp_df.head(3)

,Year,State,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,Yr Avg
0,1980,AK,10.2,10.9,10.8,10.6,9.6,10.2,8.8,8.2,8.5,8.8,9.3,9.6,9.6
1,1981,AK,11.0,11.0,10.3,9.1,8.8,9.5,8.3,8.0,8.4,8.8,9.5,9.9,9.4
2,1982,AK,11.4,11.6,11.1,10.3,9.9,10.1,8.7,8.2,8.6,9.1,10.0,10.3,9.9

In [93]:
# unemp_df.dtypes

In [94]:
# for column in unemp_df.columns:
#   print(f"Column {column} has {unemp_df[column].isnull().sum()} null values")

In [95]:
# print(f"Duplicate entries: {unemp_df.duplicated().sum()}")

In [96]:
# Create a new DataFrame with columns Year, State, Average
unemp_df = unemp_df.drop(columns=["Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct","Nov","Dec"])
unemp_df.head(3)

   Year State  Yr Avg
0  1980    AK     9.6
1  1981    AK     9.4
2  1982    AK     9.9

In [97]:
# Combine Year / State into a single ID Column, drop Individual columns
unemp_df["Year"] = unemp_df["Year"].astype(str)
unemp_df["YrSt_ID"] = unemp_df["Year"] +" - "+ unemp_df["State"]
unemp_df = unemp_df.drop(columns=["Year","State"])

In [98]:
unemp_df = unemp_df[["YrSt_ID","Yr Avg"]]
unemp_df = unemp_df.rename(columns={"Yr Avg":"Yr_Avg"})
unemp_df.head(3)

     YrSt_ID  Yr_Avg
0  1980 - AK     9.6
1  1981 - AK     9.4
2  1982 - AK     9.9

In [102]:
unemp_df = unemp_df.set_index("YrSt_ID")
unemp_df.head(3)

           Yr_Avg
YrSt_ID
1980 - AK     9.6
1981 - AK     9.4
1982 - AK     9.9

FBI Crime EDA